VanillaID/README.md

# Table of Contents

1.  [Intro](#org7a6d44b)
2.  [Demo](#orgc568925)
3.  [Useful things to know](#orgba03f5a)
    1.  [Hill functions are too simple for my application. Can I use something more complicated?](#orgfdb7e1d)
    2.  [I constructed a gene regulatory networks using *geneGraph*. I want to make sure that I simulate the right thing.](#orgc6f5141)
4.  [File list](#org5f16a3b)
    1.  [Main folder](#org5cd80b2)
    2.  [checkpoints](#org583b54f)
    3.  [errorModel](#orgd55e194)
    4.  [simulationFiles](#org63c441c)
    5.  [simulationLibrary](#orgabbb655)
    6.  [utilities](#org5afb929)

Bayesian Identification of Gene Regulatory Networks


<a id="org7a6d44b"></a>

# Intro

  This document is a guide for the code in this directoriy which serves as the basis of my
Master's Thesis. All code was made during 2017 October to 2018 June, based on the VanillaID
system identification toolbox.


<a id="orgc568925"></a>

# Demo

For a stand-alone demo run demo.m. Note that this demo just runs the algorithm for 1
realisations and for different signal to noise ratios. This can still take couple of minutes


<a id="orgba03f5a"></a>

# Useful things to know


<a id="orgfdb7e1d"></a>

## Hill functions are too simple for my application. Can I use something more complicated?

Yes for identification, but not for generation, however it only needs a little bit of tweaking.

The abstraction file *interpretationGraph* serves exactly this purpose. 

    interpret = interpretationGraph(1);
    interpret = interpret.addBasisFunction(@(x) (x+3)^5);

This way you can add any kind of dictionary functions which will be evaluated for
all measured gene expressions that you supplied to the algorithm.

However, it is important that your function can only depend on **one gene**. Sadly, this
means that there is currently no way to extend to higher-order reactions. 


<a id="orgc6f5141"></a>

## I constructed a gene regulatory networks using *geneGraph*. I want to make sure that I simulate the right thing.

The function *geneGraph.showGraph* will show a MATLAB figure with the gene regulatory network.
There is a preliminary imlementation *geneGraph.printGraph* which let's you LaTeX TikZ graphs,
but it is not guaranteed to work. (edges often overlay on each other)


<a id="org5f16a3b"></a>

# File list


<a id="org5cd80b2"></a>

## Main folder

-   **changelog.txt:** I made a log on the changes in certain commits. It contains some information on what might be missing from the code, but it is not really helpful in my opinion.
-   **config.m:** A config file which adds the directories. All simulation runs are supposed to be run from the main folder.
-   **configserver.m:** A config file but for the server. The only difference is that it adds the CVX toolbox, because I found no other way to add the toolbox permanently from the server command line.
-   **dictionaryVisualisation.m:** Code for the visualisation of the dictionaries I've used in my thesis.
-   **eachSNR.mat:** A MAT which has combination of multiple runs.
-   **fisherAnimation.m:** A file which creates a GIF from the contents of a load file
-   **linearComparison.m:** preliminary code performing the oracle estimator lower bound calculations
-   **MAPdata.mat:** contains the combination of data used with MAP uncertainty sampling
-   **myColorMap.mat:** MAT file containing a colormap
-   **oracleLinear.mat:** a result of the linearComparison.m file
-   **Randomdata.mat:** contains results for randomised sampling
-   **serverprogressCheck.m:** checks progress of files on server
-   **serverprogress.mat:** auxiliary file for serverprogressCheck.m
-   **signalCorruption.m:** code used to noise derivative series
-   **sparseanimation3.gif:** animation generated by fisherAnimation.m
-   **tac<sub>reconstruction.m</sub>:** Contains the actual code for the Sparse Bayesian Learning algorithm
-   **testSNR.m:** 

-   **totalSNR.mat:** Another combination file with the Fisher Information metric
-   **trialRun.mat:** 


<a id="org583b54f"></a>

## checkpoints

A directory containing checkpoints for the simulations made on the server


<a id="orgd55e194"></a>

## errorModel

-   **experimentMerge.m:** merge the experiments from multiple mat files
-   **experimentMergeRandom.m:** exact replica of the first one with different filenames, just for convenience reasons
-   **graphFactoryReport2.m:** file comparing random and MAP uncertainty sampling
-   **graphFactoryReport.m:** file producing all the graphs in the thesis
-   **oracleCalculator.m:** A little snippet for calculating the oracle estimator
-   **results:** This folder has all the figures which are in the thesis


<a id="org63c441c"></a>

## simulationFiles

-   **fisherBasesParallel.m:** Varying the amount of bases to give indication how well the algorithm performs

subset selection - parallalised

-   **fisherNoiseless.m:** a single noiseless simulation of the repressilator with Fisher information adding
-   **fisherRepParallel.m:** Fisher Information Based sampling PARALLEL
-   **fisherRepParallelPinv.m:** uses the pseudoInverse ordering
-   **fisherRepressilator.m:** Fisher Information Based sampling
-   **gammaRepParallel.m:** Gamma repressilator, which uses parallelised adaptive sampling
-   **maxFisherDictionaryBatch.m:** lambda normalised Fisher code
-   **maxFisherDictionary.m:** 

-   **maxGammaDictionary.m:** performs adaptive MAP based uncertainty sampoling
-   **maxRegDetDictionaryBatch.m:** performs MAP based uncertainty sampling
-   **maxTraceFisherDictionaryBatch.m:** used to pinv
-   **randomSamplingRepressilator.m:** samples randomly


<a id="orgabbb655"></a>

## simulationLibrary

-   **demo:** demo folder containing some repressilator toy code
-   **geneGraph.m:** - abstraction file for gene regulatory networks
-   **html:** 

-   **identificationTest.m:** testing whether identification works or not but this is old code so not guaranteed to work
-   **interpretationGraph.m:** abstraction for identification
-   **rungeKuttaExample.m:** 

-   **rungeKuttaTest.m:** 

-   **simGraph.m:** lower lewel abstraction for gene regulatory networks
-   **testGeneGraph.m:** test file for gene graph
-   **testSimGraph.m:** test file for simulation graph
-   **twoGeneNetworkGenerator.m:** 


<a id="org5afb929"></a>

## utilities

-   **colorMapStore2.mat:** A version of color map for dictionary visualisation
-   **colorMapStore3.mat:** A version of color map for dictionary visualisation
-   **colormapStore.mat:** A version of color map for dictionary visualisation
-   **eachSNRgf2.mat:** No idea
-   **figureFormatter.m:** My figure formatter code to makes figures look nicer

